app/controllers/favorite_songs_controller.rb

SELECT "favorite_songs".* FROM "favorite_songs"
SELECT "songs".* FROM "songs"
---
    def index
      favorite_songs=FavoriteSong.all

INSERT INTO "favorite_songs" ("user_id", "song_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["song_id", 1], ["created_at", "2021-03-23 00:00:39.268981"], ["updated_at", "2021-03-23 00:00:39.268981"]]
---
    def create
      favorite_song = FavoriteSong.create(favorite_song_params)

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "favorite_songs".* FROM "favorite_songs" WHERE "favorite_songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      favorite_song = FavoriteSong.find(params[:id])

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "favorite_songs".* FROM "favorite_songs" WHERE "favorite_songs"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "favorite_songs" SET "note" = $1, "updated_at" = $2 WHERE "favorite_songs"."id" = $3  [["note", "Hard Song"], ["updated_at", "2021-03-23 23:27:46.936619"], ["id", 7]]
---
    def update
      favorite_song = FavoriteSong.find(params[:id])
      favorite_song.update(favorite_song_params)

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "favorite_songs".* FROM "favorite_songs" WHERE "favorite_songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "favorite_songs" WHERE "favorite_songs"."id" = $1  [["id", 1]]
---
    def destroy
      favorite_song = FavoriteSong.find(params[:id])
      favorite_song.destroy