app/controllers/songs_controller.rb

    def index
      songs=Song.all
---
SELECT "songs".* FROM "songs"

    def show
      song = Song.find(params[:id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
      # byebug
      song = Song.find(params[:id])
      song.update(song_params)
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "songs" SET "favorited" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["favorited", true], ["updated_at", "2021-03-30 00:08:36.320872"], ["id", 6]]

    def destroy
      song = Song.find(params[:id])
      song.destroy
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 1]]